# CannotMatchInstanceSizeToHostError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPSupportFailures..::..CannotMatchInstanceSizeToHostError Property
BuiltInFailures..::..MEPSupportFailures Class See Also
---
The instance of [Symbol] cannot be re-sized to match the host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMatchInstanceSizeToHostError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMatchInstanceSizeToHostError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMatchInstanceSizeToHostError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPSupportFailures Class
Autodesk.Revit.DB Namespace